backend/controllers/CategoryController.php

    public function actionCreate()
    {
        $model = new Category();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `category` (`category`) VALUES ('berita')