backend/controllers/LocationController.php

INSERT INTO `location` (`city`, `region`) VALUES ('Surabaya', 'Jawa Timur')
---
    public function actionCreate()
    {
        $model = new Location();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {