backend/controllers/PostController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $path = 'F:/xampp2/htdocs/advanced/common/assets/upload/';

        if ($model->load(Yii::$app->request->post())) {

            $model->file = UploadedFile::getInstance($model, 'file');

            if ($model->file == null) {
                $model->image = $model->findOne($model->id_post)->image;
---
SELECT * FROM `post` WHERE `id_post`='1'

    public function actionDelete($id)
    {
        if($news = News::findOne(['id_post' => $id]) !== null){
---
SELECT * FROM `post` WHERE `id_post`='5'