backend/controllers/PostController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post())) {
            $model->status = 1;
            $model->save();
            $news = new News();
            $news->id_post = $id;
            $news->status_news = 1;
            $news->date = date('d-m-Y');
            $news->save();
---
INSERT INTO `news` (`id_post`, `status_news`, `date`) VALUES (1, 1, '23-05-2019')